/** Arduino UNO                                           *** Motor_kru.cpp ***
 * 
 * Драйвер электромотора с использованием широтно-импульсной модуляции на 
 * двух n-канальных полевых транзисторов IRFZ24N и двух p-канальных полевых 
 * транзисторов IRF9Z24N.
 * 
 * v2.0, 25.03.2024                                   Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 24.03.2024
**/

#include "Motor_kru.h" 


MyStruct MotorKrutjak::compute() 
{
  MyStruct str;
  int val1=5;
  int val2=2;
  str.valSum = val1 + val2;
  str.valSub = val1 - val2;
  str.valMul = val1 * val2;
  return str;
}




// ****************************************************************************
// *         Управлять скоростью мотора и направлением его вращения           *
// ****************************************************************************
void MotorKrutjak::Driver() 
{
   ValRes = analogRead(PinRes);                  // считали напряжение с потенциометра
   if (ValRes<512)
   {
      ValPWM_L = map(ValRes, 0,512, 255,0);      // расчитали напряжение ШИМ
      ValPWM_R = 0;   
   }
   else
   {
      ValPWM_R = map(ValRes, 512,1023, 0,255);   // расчитали напряжение ШИМ
      ValPWM_L = 0;   
   }
   
   // Если мотор подключен к драйверу, вращаем мотор
   if (isConnect==true)
   {
      //analogWrite(PinPWM_L,ValPWM_L);     
      //analogWrite(PinPWM_R,ValPWM_R);        
      analogWrite(PinPWM_L,0);     
      analogWrite(PinPWM_R,20);        
   }
}
// ****************************************************************************
// *              Остановить мотор и отключить его от драйвера                *
// ****************************************************************************
void MotorKrutjak::Disconnect() 
{
   isConnect=false; 
   analogWrite(PinPWM_L,0);     
   analogWrite(PinPWM_R,0);        
}
// ****************************************************************************
// *                        Подключить мотор к драйверу                       *
// ****************************************************************************
void MotorKrutjak::Connect() 
{
   isConnect=true; 
}

// ********************************************************** Motor_kru.cpp ***
