/** Arduino, Esp32-CAM ************************************ common_kvizzy.h ***
 * 
 * Определить общие функции нижнего уровня умного хозяйства на двух светодиодах
 * 
 * v1.1.1, 24.12.2024                                 Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 26.10.2024
**/

#pragma once            
#include <Arduino.h>

// * Задача FreRTOS ***********************************************************
// *      Выбрать из очереди и вывести сообщения в последовательный порт      *
// ****************************************************************************
void vPrint(void* pvParameters) 
{
   for (;;)
   {
      //queMessa.PostAll();
      // Отмечаем флагом, что цикл задачи успешно завершен   
      fwdtPrint = true;
      vTaskDelay(439/portTICK_PERIOD_MS); 
   }
}
// ****************************************************************************
// *                      --Преобразовать json-документ в строку              *
// *                      --https://arduinojson.org/                          *
// ****************************************************************************
String jison1()
{
   String str = "***";
   return str;
}


// Может пригодится!!!

// Сделать определитель типов:
#define tstr "tstr"
#define tchr "tchr"
#define tint "tint"
String types(String a) {return tstr;}
String types(char *a)  {return tchr;}
String types(int a)    {return tint;}

// ******************************************************** common_kvizzy.h ***
