/** Arduino, Esp32-CAM ************************************ common_kvizzy.h ***
 * 
 * Определить общие функции нижнего уровня умного хозяйства на двух светодиодах
 * 
 * v1.0, 26.10.2024                                   Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 26.10.2024
**/

#ifndef common_kvizzy
#define common_kvizzy
#pragma once            

#include <Arduino.h>

// ****************************************************************************
// *                      --Преобразовать json-документ в строку              *
// *                      --https://arduinojson.org/                          *
// ****************************************************************************
String jison1()
{
   String str = "***";
   return str;
}

#endif

// ******************************************************** common_kvizzy.h ***
