/** Arduino, Esp32-CAM ****************************************** Errme.hpp ***
 * 
 *     Оghtltkбеспечить единообразный вывод сообщений об ошибках на платформе Arduino
 * 
 * v1.0, 10.11.2024                                   Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 10.11.2024
**/


#include <Arduino.h>

// ****************************************************************************
// *                     Вывести сообщение с кодом ошибки                     *
// ****************************************************************************

// ************************************************************** Errme.hpp ***
