/** Arduino, Esp32-CAM ******************************************** Errme.h ***
 * 
 *     Обеспечить единообразный вывод сообщений об ошибках на платформе Arduino
 * 
 * v1.0, 10.11.2024                                   Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 10.11.2024
**/

#ifndef err_me
#define err_me
#pragma once            

#include <Arduino.h>

// Разрешаем вывести полное сообщение вместе с кодом
#define ERROR_FULL_MESSAGE

// ****************************************************************************
// *                     Вывести сообщение с кодом ошибки                     *
// ****************************************************************************
void errme(String task, int error, String lib = "Self") 
{
}

#endif

// **************************************************************** Errme.h ***
