/** Arduino, Esp32-CAM ******************************************** Serme.h ***
 * 
 *                          Обеспечить общий вывод сообщений в последовательный 
 *                                           порт из всех задач и деятельностей
 * 
 * v1.3, 25.11.2024                                   Автор:      Труфанов В.Е.
 * Copyright © 2024 tve                               Дата создания: 26.10.2024
**/

#ifndef h_Serme
#define h_Serme
#pragma once            

#include <Arduino.h>

// ****************************************************************************
// *          ----Проверить состояние процессора и сформировать json-строку       *
// ****************************************************************************

#endif

// **************************************************************** Serme.h ***
